app/controllers/books_controller.rb

	def create
		@book = Book.new(book_params)

		if @book.save
---
INSERT INTO "books" ("title", "author", "year", "genre") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", ""], ["author", ""], ["year", ""], ["genre", ""]]

	def edit
		# raise params

		@book = Book.find_by(id: params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		@book = Book.find_by(id: params[:id])

		if @book
			@book.update!(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "year" = $1 WHERE "books"."id" = $2  [["year", "2011"], ["id", 1]]

	def destroy
		@book = Book.find_by(id: params[:id])

		if @book
			@book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 2]]